Catalogs/Лиды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Лиды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресЭПДляПоиска</Name>
					<Comment>Адрес ЭП для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантЗавершенияРаботыСЛидом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаЛидов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаметкиЗавершенияРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПривлеченияПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактыПеренесены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКомпании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефонаДляПоиска</Name>
					<Comment>Номер телефона для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНеуспешногоЗавершенияРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныНеуспешногоЗавершенияРаботыСЛидом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЛида</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЛидов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЛидов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьКонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьКонтакты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СвязиКонтрагентЛид.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СвязиКонтрагентЛид</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лиды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СвязиАдресатКонтактCRM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СвязиАдресатКонтактCRM</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Адресат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресатыПисем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтактCRM</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтактПисьма</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантЗавершенияРаботыСЛидом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВариантЗавершенияРаботыСЛидом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПереведенВПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НекачественныйЛид</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосударственныйОрган</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Лиды/Forms/ФормаВыбораДублей/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Контакты = Новый Массив;
	
	ОчиститьНастройкуФормы();
	
	Параметры.Свойство("Наименование", Наименование);
	Параметры.Свойство("НаименованиеПолное", НаименованиеПолное);
	Параметры.Свойство("ТипКИ", ТипКИ);
	Параметры.Свойство("СсылкаНаРедактируемыйОбъект", СсылкаНаРедактируемыйОбъект);
	Параметры.Свойство("ПредставлениеКИ", ПредставлениеКИ);
	
	ОбновитьДубли();
	УправлениеФормой();
	УстановитьУсловноеОформление();
	
	ТекущийЭлемент = Элементы.ДеревоДублей;
	Если ДеревоДублей.ПолучитьЭлементы().Количество() > 0 Тогда
		
		НомерСтроки = 1;
		
		Элементы.ДеревоДублей.ТекущаяСтрока = НомерСтроки;
		ИзменитьДанныеКлиента(НомерСтроки);
		
	КонецЕсли;
	
	ИзменитьИнтерфейсДляМобильногоКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	НужноОбратитьсяНаСервер = 
	ИмяСобытия = "ПроизведенаЗаменаСсылок"
	Или ИмяСобытия = "Запись_Контрагент"
	Или ИмяСобытия = "Запись_КонтактноеЛицо"
	Или ИмяСобытия = "Запись_Лид";
	
	Если НужноОбратитьсяНаСервер Тогда
		ОтветОтСервера = ОбработкаОповещенияНаСервере(ИмяСобытия);
	Иначе
		ОтветОтСервера = Новый Структура;
	КонецЕсли;
	
	Если ОтветОтСервера.Свойство("ИдентификаторыСтрокГруппировок") Тогда
		Для Каждого Идентификатор Из ОтветОтСервера.ИдентификаторыСтрокГруппировок Цикл
			Элементы.ДеревоДублей.Развернуть(Идентификатор);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИнформацияПоКлиентуОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если СтрНачинаетсяС(НавигационнаяСсылкаФорматированнойСтроки, "e1cib") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ТекущийКлиент) Тогда
		Возврат;
	КонецЕсли;
	
	ТипКлиента = ТипЗнч(ТекущийКлиент);
	Если ТипКлиента = Тип("СправочникСсылка.Контрагенты") Тогда
		ОткрытиеИнформацииПоКонтрагенту(ТекущийКлиент);
	ИначеЕсли ТипКлиента = Тип("СправочникСсылка.КонтактныеЛица") Тогда
		ОткрытиеИнформацииПоКонтакту(ТекущийКлиент);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(ТекущийКлиент) Тогда
		Возврат;
	КонецЕсли;
	
	ТипКлиента = ТипЗнч(ТекущийКлиент);
	
	Если ТипКлиента = Тип("СправочникСсылка.КонтактныеЛица")
		Или ТипКлиента = Тип("СправочникСсылка.Лиды") Тогда
		
		ПараметрыФормы = Новый Структура("Контакт", ТекущийКлиент);
		ОткрытьФорму("Документ.Событие.Форма.ФормаСписка",
		ПараметрыФормы, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
		
	КонецЕсли;
	
	Если ТипКлиента <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("Контрагент", ТекущийКлиент);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	ПараметрыФормы.Вставить("КлючНастроек", ТекущийКлиент);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ОткрытьФорму("Обработка.ДокументыПоКритериюОтбора.Форма.СписокДокументов",
	ПараметрыФормы, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоДублей

&НаКлиенте
Процедура ДеревоДублейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.ДеревоДублей.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ДеревоДублейКоманда Тогда
		
		Если Не ПустаяСтрока(Элементы.ДеревоДублей.ТекущиеДанные.Команда)
			И ЗначениеЗаполнено(Элементы.ДеревоДублей.ТекущиеДанные.Тип) Тогда
			
			ОбъединитьКлиентовПоТипу(Элементы.ДеревоДублей.ТекущиеДанные.Тип);
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ВыбранаСтрокаСКлиентом() Тогда
		Возврат;
	КонецЕсли;
	
	Ссылка = Элементы.ДеревоДублей.ТекущиеДанные.Ссылка;
	
	ПараметрыФормы = Новый Структура("Ключ", Ссылка);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	ИмяФормыОткрытия = ИмяФормыПоТипуСсылки(Ссылка);
	ОткрытьФорму(ИмяФормыОткрытия, ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДублейПриАктивизацииСтроки(Элемент)
	
	Если Не ВыбранаСтрокаСКлиентом() Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ДеревоДублейПриАктивизацииСтрокиОбработчик", 0.2, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НекачественныйЛид(Команда)
	
	Если Не ВыбранаСтрокаСКлиентом()
		Или ТипЗнч(Элементы.ДеревоДублей.ТекущиеДанные.Ссылка) <> Тип("СправочникСсылка.Лиды") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ДеревоДублей.ТекущиеДанные;
	
	ВариантЗавершения = НекачественныйЛидНаСервере(ТекущиеДанные.Ссылка);
	Если ВариантЗавершения = Неопределено Тогда
		ПредупреждениеОНевозможностиЧтенияОбъекта();
		Возврат;
	КонецЕсли;
	
	Если ВариантЗавершения
		= ПредопределенноеЗначение("Перечисление.ВариантЗавершенияРаботыСЛидом.НекачественныйЛид") Тогда
		
		ТекстПредупреждения = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru = 'Лид <a href=""%1"">%2</a> уже помечен некачественным'"),
		ПолучитьНавигационнуюСсылку(ТекущиеДанные.Ссылка), ТекущиеДанные.Представление);
		
		ПредупреждениеАсинх(ТекстПредупреждения);
		Возврат;
		
	КонецЕсли;
	
	НекачественныйЛид = ТекущиеДанные.Ссылка;
	Оповещение = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНекачественногоЛида", ЭтотОбъект);
	ОткрытьФорму("Справочник.Лиды.Форма.ФормаНекачественныйЛидКанбан", , , , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СвязатьСТекущимЛидом(Команда)
	
	Если Не ВыбранаСтрокаСКлиентом()
		Или ТипЗнч(Элементы.ДеревоДублей.ТекущиеДанные.Ссылка) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ДеревоДублей.ТекущиеДанные;
	
	Если Не ЧтениеРазрешено(ТекущиеДанные.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ПометкаУдаления Тогда
		
		ОтветПользователя = Ждать ВопросАсинх(
		НСтр("ru = 'Контрагент помечен на удаление. Связать его с текущим лидом?'"),
		РежимДиалогаВопрос.ДаНет);
		Если Не ОтветПользователя = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("КонтрагентДляСвязиСЛидом", ТекущиеДанные.Ссылка);
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиККлиенту(Команда)
	
	Если Не ВыбранаСтрокаСКлиентом() Тогда
		Возврат;
	КонецЕсли;
	
	Ссылка = Элементы.ДеревоДублей.ТекущиеДанные.Ссылка;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Лиды") И Не ЗначениеЗаполнено(СсылкаНаРедактируемыйОбъект) Тогда
		ПерейтиКЛиду(Ссылка);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", Ссылка);
	ИмяФормыОткрытия = ИмяФормыПоТипуСсылки(Ссылка);
	ОткрытьФорму(ИмяФормыОткрытия, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдаление(Команда)
	
	Если Не ВыбранаСтрокаСКлиентом() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ДеревоДублей.ТекущиеДанные;
	
	ОтветОтСервера = ПометитьНаУдалениеНаСервере(ТекущиеДанные.Ссылка, ТекущиеДанные.ПометкаУдаления);
	ОповеститьОбИзменении(ТекущиеДанные.Ссылка);
	
	ТекущиеДанные.ПометкаУдаления = Не ТекущиеДанные.ПометкаУдаления;
	ТекущиеДанные.НомерИконки = ОтветОтСервера.НомерИконки;
	
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	Если Не ВыбранаСтрокаСКлиентом() Тогда
		Возврат;
	КонецЕсли;
	
	Ссылка = Элементы.ДеревоДублей.ТекущиеДанные.Ссылка;
	
	ПараметрыФормы = Новый Структура("Ключ", Ссылка);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	ИмяФормыОткрытия = ИмяФормыПоТипуСсылки(Ссылка);
	ОткрытьФорму(ИмяФормыОткрытия, ПараметрыФормы, Элементы.ДеревоДублей);
	
КонецПроцедуры

&НаКлиенте
Процедура Объединить(Команда)
	
	Если Команда.Имя = "ОбъединитьКонтрагентов" Тогда
		ОбъединитьКлиентовПоТипу("Контрагент");
	ИначеЕсли Команда.Имя = "ОбъединитьКонтакты" Тогда
		ОбъединитьКлиентовПоТипу("Контакт");
	ИначеЕсли Команда.Имя = "ОбъединитьЛиды" Тогда
		ОбъединитьКлиентовПоТипу("Лид");
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИзменениеИнтерфейсаПоДанным

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ДеревоДублейНаименованиеПолное.Видимость = ЗначениеЗаполнено(НаименованиеПолное);
	Элементы.ДеревоДублейПредставлениеКИ.Видимость = ЗначениеЗаполнено(ТипКИ);
	Элементы.ДеревоДублейПредставлениеКИ.Заголовок = 
	?(ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон, НСтр("ru = 'Телефон'"), НСтр("ru = 'E-mail'"));
	
	ОбновитьШиринуКолонок();
	УстановитьВидимостьКомандОбъединения();
	
	Заголовок = ЗаголовокФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьШиринуКолонок()
	
	Если Не ЗначениеЗаполнено(НаименованиеПолное) И Не ЗначениеЗаполнено(ТипКИ) Тогда
		
		Элементы.ДеревоДублей.Ширина = 48;
		Элементы.ДеревоДублейНаименованиеГруппы.Ширина = 40;
		
	Иначе
		
		Элементы.ДеревоДублей.Ширина = 60;
		Элементы.ДеревоДублейНаименованиеГруппы.Ширина = 52;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаголовокФормы()
	
	Если ЗначениеЗаполнено(ПредставлениеКИ) Тогда
		Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Возврат НСтр("ru = 'Список дублей по номеру телефона'");
		Иначе
			Возврат НСтр("ru = 'Список дублей по номеру e-mail'");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НаименованиеПолное) Тогда
		Возврат НСтр("ru = 'Список дублей по юр. названию'");
	КонецЕсли;
	
	Возврат НСтр("ru='Список дублей по представлению'");
	
КонецФункции

&НаСервере
Процедура ОчиститьНастройкуФормы()
	
	КлючОбъекта = "Справочники.Лиды.ФормаВыбораДублей/НастройкиОкна";
	ХранилищеСистемныхНастроек.Удалить(КлючОбъекта, "", ИмяПользователя());
	КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор,
	"ДеревоДублей.Ссылка", Неопределено, ВидСравненияКомпоновкиДанных.Заполнено);
	
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить(Элементы.ДеревоДублейНаименованиеГруппы.Имя);
	ОформляемыеПоля.Добавить(Элементы.ДеревоДублейКоманда.Имя);
	
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(
	НовоеУсловноеОформление, "Видимость", Ложь);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(
	НовоеУсловноеОформление, "Отображать", Ложь);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор,
	"ДеревоДублей.Ссылка", Неопределено, ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить(Элементы.ДеревоДублейИконка.Имя);
	ОформляемыеПоля.Добавить(Элементы.ДеревоДублейНаименование.Имя);
	ОформляемыеПоля.Добавить(Элементы.ДеревоДублейНаименованиеПолное.Имя);
	ОформляемыеПоля.Добавить(Элементы.ДеревоДублейПредставлениеКИ.Имя);
	ОформляемыеПоля.Добавить(Элементы.ДеревоДублейОтветственныйПредставление.Имя);
	ОформляемыеПоля.Добавить(Элементы.ДеревоДублейКод.Имя);
	
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(
	НовоеУсловноеОформление, "Видимость", Ложь);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(
	НовоеУсловноеОформление, "Отображать", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКомандОбъединения()
	
	УстановитьВидимостьКомандыОбъединения("Контрагент");
	УстановитьВидимостьКомандыОбъединения("Контакт");
	УстановитьВидимостьКомандыОбъединения("Лид");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКомандыОбъединения(ТипЭлементов)
	
	СтрокиГруппировки = ДеревоДублей.ПолучитьЭлементы();
	Для Каждого СтрокаГруппировки Из СтрокиГруппировки Цикл
		
		Если СтрокаГруппировки.Тип <> ТипЭлементов Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементыГруппы = СтрокаГруппировки.ПолучитьЭлементы();
		Если ЭлементыГруппы.Количество() > 1 Тогда
			СтрокаГруппировки.Команда = НСтр("ru = 'Объединить'");
		Иначе
			СтрокаГруппировки.Команда = "";
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьИнтерфейсДляМобильногоКлиента()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ДеревоДублей.Шапка = Ложь;
	
	Элементы.ДеревоДублейКоманда.Видимость = Ложь;
	Элементы.ОбъединитьКонтрагентов.Видимость = Истина;
	Элементы.ОбъединитьКонтакты.Видимость = Истина;
	Элементы.ОбъединитьЛиды.Видимость = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДублей

&НаСервере
Процедура ОбновитьДубли()
	
	ДеревоДублей.ПолучитьЭлементы().Очистить();
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		ОбновитьДублиПоНаименованию();
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НаименованиеПолное) Тогда
		ОбновитьДублиПоПолномуНаименованию();
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипКИ) Тогда
		ОбновитьДублиПоКИ();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДублиПоПолномуНаименованию()
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДублей("ПоПолномуНаименованию");
	Запрос.УстановитьПараметр("Наименование", НаименованиеПолное);
	Запрос.УстановитьПараметр("ПолноеНаименованиеКонтакта", """");
	
	УстановитьПривилегированныйРежим(Истина);
	ЗаполнитьДеревоПоРезультатуЗапроса(Запрос.Выполнить());
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДублиПоКИ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДублей("ПоКИ");
	
	Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "АдресЭП", "НомерТелефона");
		
		ПредставлениеКИДляПоиска = КонтактнаяИнформацияУНФ.ПреобразоватьНомерДляКонтактнойИнформации(ПредставлениеКИ);
		ПредставлениеКИДляПоиска = СтрЗаменить(ПредставлениеКИДляПоиска, "+", "");
		Если СтрНачинаетсяС(ПредставлениеКИДляПоиска, "7") Тогда
			ПредставлениеКИДляПоиска = Сред(ПредставлениеКИДляПоиска, 2, СтрДлина(ПредставлениеКИДляПоиска) - 1);
		КонецЕсли;
		
	Иначе
		ПредставлениеКИДляПоиска = ПредставлениеКИ;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПредставлениеКИ",
	СтрШаблон("%%%1%%", ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(ПредставлениеКИДляПоиска)));
	
	УстановитьПривилегированныйРежим(Истина);
	ЗаполнитьДеревоПоРезультатуЗапроса(Запрос.Выполнить());
	УстановитьПривилегированныйРежим(Ложь);
	
	ЭлементыДерева = ДеревоДублей.ПолучитьЭлементы();
	Для Каждого Дубль Из ЭлементыДерева Цикл
		
		ИндексКИ = СтрНайти(Дубль.ПредставлениеКИ, ПредставлениеКИДляПоиска);
		КонечныйИндекс = СтрНайти(Дубль.ПредставлениеКИ, ",", ,ИндексКИ);
		КонечныйИндекс = ?(КонечныйИндекс = 0, СтрДлина(Дубль.ПредставлениеКИ), КонечныйИндекс - 1);
		
		Дубль.ПредставлениеКИ = Сред(Дубль.ПредставлениеКИ, ИндексКИ, КонечныйИндекс - 1);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДублиПоНаименованию()
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДублей("ПоНаименованию");
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	УстановитьПривилегированныйРежим(Истина);
	ЗаполнитьДеревоПоРезультатуЗапроса(Запрос.Выполнить());
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаДублей(ТипДублей = "ПоНаименованию")
	
	Результат =
	"ВЫБРАТЬ ПЕРВЫЕ 20
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Код КАК Код,
	|	Контрагенты.Наименование КАК Наименование,
	|	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеПолное,
	|	ВЫРАЗИТЬ(Контрагенты.АдресЭПДляПоиска КАК СТРОКА(1000)) КАК ПредставлениеКИ,
	|	""Контрагент"" КАК Тип,
	|	1 КАК РеквизитДопУпорядочивания,
	|	ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель)
	|				ИЛИ Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ФизическоеЛицо)
	|			ТОГДА ВЫБОР
	|					КОГДА Контрагенты.ПометкаУдаления
	|						ТОГДА 11
	|					ИНАЧЕ 3
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Контрагенты.ПометкаУдаления
	|					ТОГДА 10
	|				ИНАЧЕ 2
	|			КОНЕЦ
	|	КОНЕЦ КАК НомерИконки,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Контрагенты.Ответственный) КАК ОтветственныйПредставление,
	|	Контрагенты.ПометкаУдаления КАК ПометкаУдаления,
	|	"""" КАК Представление
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	(Контрагенты.НаименованиеПолное ПОДОБНО &Наименование
	|			ИЛИ Контрагенты.Наименование ПОДОБНО &Наименование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 20
	|	Контакты.Ссылка,
	|	Контакты.Код,
	|	Контакты.Наименование,
	|	&ПолноеНаименованиеКонтакта,
	|	ВЫРАЗИТЬ(Контакты.АдресЭПДляПоиска КАК СТРОКА(1000)),
	|	""Контакт"",
	|	2,
	|	ВЫБОР
	|		КОГДА Контакты.ПометкаУдаления
	|			ТОГДА 12
	|		ИНАЧЕ 4
	|	КОНЕЦ,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Контакты.Ответственный),
	|	Контакты.ПометкаУдаления,
	|	""""
	|ИЗ
	|	Справочник.КонтактныеЛица КАК Контакты
	|ГДЕ
	|	Контакты.Наименование ПОДОБНО &Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 20
	|	Лиды.Ссылка,
	|	Лиды.Код,
	|	Лиды.Наименование,
	|	ВЫРАЗИТЬ(Лиды.НаименованиеКомпании КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(ЕСТЬNULL(СвязиКонтрагентЛид.Контрагент.АдресЭПДляПоиска, Лиды.АдресЭПДляПоиска) КАК СТРОКА(1000)),
	|	""Лид"",
	|	3,
	|	ВЫБОР
	|		КОГДА Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
	|			ТОГДА ВЫБОР
	|					КОГДА Лиды.ПометкаУдаления
	|						ТОГДА 16
	|					ИНАЧЕ 8
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Лиды.ПометкаУдаления
	|					ТОГДА 15
	|				ИНАЧЕ 7
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Лиды.Ответственный),
	|	Лиды.ПометкаУдаления,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Лиды.Ссылка)
	|ИЗ
	|	Справочник.Лиды КАК Лиды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
	|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид
	|ГДЕ
	|	Лиды.ВариантЗавершения <> ЗНАЧЕНИЕ(Перечисление.ВариантЗавершенияРаботыСЛидом.ПереведенВПокупателя)
	|	И ВЫБОР
	|			КОГДА Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
	|				ТОГДА Лиды.Наименование ПОДОБНО &Наименование
	|			ИНАЧЕ Лиды.Наименование ПОДОБНО &Наименование
	|					ИЛИ Лиды.НаименованиеКомпании ПОДОБНО &Наименование
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитДопУпорядочивания,
	|	Наименование";
	
	Если ТипДублей = "ПоПолномуНаименованию" Тогда
		
		Результат = СтрЗаменить(Результат,
		"И ВЫБОР
		|			КОГДА Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
		|				ТОГДА Лиды.Наименование ПОДОБНО &Наименование
		|			ИНАЧЕ Лиды.Наименование ПОДОБНО &Наименование
		|					ИЛИ Лиды.НаименованиеКомпании ПОДОБНО &Наименование
		|		КОНЕЦ",
		"И Лиды.Вид <> ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
		|	И (Лиды.НаименованиеКомпании ПОДОБНО &Наименование
		|			ИЛИ Лиды.Наименование ПОДОБНО &Наименование)");
		
	Иначе
		
		Результат = СтрЗаменить(Результат,
		"ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеПолное,", "");
		Результат = СтрЗаменить(Результат, "&ПолноеНаименованиеКонтакта,", "");
		Результат = СтрЗаменить(Результат, "ВЫРАЗИТЬ(Лиды.НаименованиеКомпании КАК СТРОКА(1000)),", "");
		
	КонецЕсли;
	
	Если ТипДублей = "ПоКИ" Тогда
		
		Результат = СтрЗаменить(Результат,
		"(Контрагенты.НаименованиеПолное ПОДОБНО &Наименование
		|			ИЛИ Контрагенты.Наименование ПОДОБНО &Наименование)",
		"Контрагенты.АдресЭПДляПоиска ПОДОБНО &ПредставлениеКИ СПЕЦСИМВОЛ ""~""");
		Результат = СтрЗаменить(Результат,
		"Контакты.Наименование ПОДОБНО &Наименование",
		"Контакты.АдресЭПДляПоиска ПОДОБНО &ПредставлениеКИ СПЕЦСИМВОЛ ""~""");
		
		Результат = СтрЗаменить(Результат,
		"И ВЫБОР
		|			КОГДА Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
		|				ТОГДА Лиды.Наименование ПОДОБНО &Наименование
		|			ИНАЧЕ Лиды.Наименование ПОДОБНО &Наименование
		|					ИЛИ Лиды.НаименованиеКомпании ПОДОБНО &Наименование
		|		КОНЕЦ",
		"И ВЫБОР
		|			КОГДА Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
		|				ТОГДА ЕСТЬNULL(СвязиКонтрагентЛид.Контрагент.АдресЭПДляПоиска, Лиды.АдресЭПДляПоиска)
		|			ИНАЧЕ Лиды.АдресЭПДляПоиска
		|		КОНЕЦ ПОДОБНО &ПредставлениеКИ СПЕЦСИМВОЛ ""~""");
		
	Иначе
		
		Результат = СтрЗаменить(Результат,
		"ВЫРАЗИТЬ(Контрагенты.АдресЭПДляПоиска КАК СТРОКА(1000)) КАК ПредставлениеКИ,", "");
		Результат = СтрЗаменить(Результат, "ВЫРАЗИТЬ(Контакты.АдресЭПДляПоиска КАК СТРОКА(1000)),", "");
		Результат = СтрЗаменить(Результат,
		"ВЫРАЗИТЬ(ЕСТЬNULL(СвязиКонтрагентЛид.Контрагент.АдресЭПДляПоиска, Лиды.АдресЭПДляПоиска) КАК СТРОКА(1000)),", "");
		
		Результат = СтрЗаменить(Результат,
		"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид", "");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоПоРезультатуЗапроса(РезультатЗапроса)
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СтрокаГруппыКонтрагентов = Неопределено;
	СтрокаГруппыКонтактов = Неопределено;
	СтрокаГруппыЛидов = Неопределено;
	ЗаголовокКомандыОбъединить = НСтр("ru = 'Объединить'");
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Тип = "Контрагент" Тогда
			
			Если СтрокаГруппыКонтрагентов = Неопределено Тогда
				СтрокаГруппыКонтрагентов = ДеревоДублей.ПолучитьЭлементы().Добавить();
				СтрокаГруппыКонтрагентов.Наименование = НСтр("ru = 'Контрагенты'");
				СтрокаГруппыКонтрагентов.НомерИконки = -1;
				СтрокаГруппыКонтрагентов.Команда = ЗаголовокКомандыОбъединить;
				СтрокаГруппыКонтрагентов.Тип = "Контрагент";
			КонецЕсли;
			
			СтрокаГруппировки = СтрокаГруппыКонтрагентов;
			
		КонецЕсли;
		
		Если Выборка.Тип = "Контакт" Тогда
			
			Если СтрокаГруппыКонтактов = Неопределено Тогда
				СтрокаГруппыКонтактов = ДеревоДублей.ПолучитьЭлементы().Добавить();
				СтрокаГруппыКонтактов.Наименование = НСтр("ru = 'Контакты'");
				СтрокаГруппыКонтактов.НомерИконки = -1;
				СтрокаГруппыКонтактов.Команда = ЗаголовокКомандыОбъединить;
				СтрокаГруппыКонтактов.Тип = "Контакт";
			КонецЕсли;
			
			СтрокаГруппировки = СтрокаГруппыКонтактов;
			
		КонецЕсли;
		
		Если Выборка.Тип = "Лид" Тогда
			
			Если СтрокаГруппыЛидов = Неопределено Тогда
				СтрокаГруппыЛидов = ДеревоДублей.ПолучитьЭлементы().Добавить();
				СтрокаГруппыЛидов.Наименование = НСтр("ru = 'Лиды'");
				СтрокаГруппыЛидов.НомерИконки = -1;
				СтрокаГруппыЛидов.Команда = ЗаголовокКомандыОбъединить;
				СтрокаГруппыЛидов.Тип = "Лид";
			КонецЕсли;
			
			СтрокаГруппировки = СтрокаГруппыЛидов;
			
		КонецЕсли;
		
		НоваяСтрока = СтрокаГруппировки.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Контрагенты

&НаКлиенте
Процедура ОткрытиеИнформацииПоКонтрагенту(Ссылка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент", Ссылка);
	ОткрытьФорму("Справочник.Лиды.ФормаСписка",
	ПараметрыФормы, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиДанныеПоКонтрагенту(ДанныеСтроки)
	
	КоличествоДокументов = КоличествоДокументовКлиента(ДанныеСтроки.Ссылка);
	
	ДанныеКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
	ДанныеСтроки.Ссылка, "Поставщик,Покупатель,ПрочиеОтношения");
	
	Если ДанныеКонтрагента.Покупатель И ДанныеКонтрагента.Поставщик И ДанныеКонтрагента.ПрочиеОтношения Тогда
		ТипКлиента = НСтр("ru = 'Контрагент: Покупатель, Поставщик, Прочие отношения'");
	ИначеЕсли ДанныеКонтрагента.Покупатель И ДанныеКонтрагента.Поставщик Тогда
		ТипКлиента = НСтр("ru = 'Контрагент: Покупатель, Поставщик'");
	ИначеЕсли ДанныеКонтрагента.Покупатель И ДанныеКонтрагента.ПрочиеОтношения Тогда
		ТипКлиента = НСтр("ru = 'Контрагент: Покупатель, Прочие отношения'");
	ИначеЕсли ДанныеКонтрагента.Покупатель Тогда
		ТипКлиента = НСтр("ru = 'Контрагент: Покупатель'");
	ИначеЕсли ДанныеКонтрагента.Поставщик И ДанныеКонтрагента.ПрочиеОтношения Тогда
		ТипКлиента = НСтр("ru = 'Контрагент: Поставщик, Прочие отношения'");
	ИначеЕсли ДанныеКонтрагента.Поставщик Тогда
		ТипКлиента = НСтр("ru = 'Контрагент: Поставщик'");
	ИначеЕсли ДанныеКонтрагента.ПрочиеОтношения Тогда
		ТипКлиента = НСтр("ru = 'Контрагент: Прочие отношения'");
	Иначе
		ТипКлиента = НСтр("ru = 'Контрагент'");
	КонецЕсли;
	
	ПредставлениеЛидовКонтрагента = Справочники.Контрагенты.ПредставлениеЛидовКонтрагента(ДанныеСтроки.Ссылка);
	ВидимостьИнформацииПоКлиенту = Не ПустаяСтрока(ПредставлениеЛидовКонтрагента);
	
	Элементы.НаименованиеКлиента.Заголовок = ДанныеСтроки.Наименование;
	Элементы.ТипКлиента.Заголовок = СтрШаблон("(%1)", ТипКлиента);
	Элементы.Документы.Заголовок = СтрШаблон(НСтр("ru = 'Документы (%1)'"), КоличествоДокументов);
	Элементы.ПометитьКонтрагентаНаУдаление.Заголовок = ЗаголовокКнопкиНаПометкуНаУдаление(ДанныеСтроки.ПометкаУдаления);
	
	Если ВидимостьИнформацииПоКлиенту Тогда
		Элементы.ИнформацияПоКлиенту.Видимость = Истина;
		Элементы.ИнформацияПоКлиенту.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = 'Лиды: <a href=""https://1c.ru"">%1</a>'"),
		ПредставлениеЛидовКонтрагента);
	Иначе
		Элементы.ИнформацияПоКлиенту.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.СтраницыКоманды.ТекущаяСтраница = Элементы.СтраницаКомандыКонтрагентов;
	
КонецПроцедуры

#КонецОбласти

#Область Контакты

&НаКлиенте
Асинх Процедура ОткрытиеИнформацииПоКонтакту(Ссылка)
	
	ДанныеОтСервера = ОткрытииИнформацииПоКонтактуНаСервере(Ссылка);
	
	СписокВыбора = Новый СписокЗначений;
	Для Каждого ДанныеКонтрагента Из ДанныеОтСервера Цикл
		СписокВыбора.Добавить(ДанныеКонтрагента.Ссылка, ДанныеКонтрагента.Представление, , ДанныеКонтрагента.Картинка);
	КонецЦикла;
	
	ВыборПользователя = Ждать ВыбратьИзСпискаАсинх(СписокВыбора, Элементы.ИнформацияПоКлиенту);
	Если ВыборПользователя = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", ВыборПользователя.Значение);
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОткрытииИнформацииПоКонтактуНаСервере(Знач Ссылка)
	
	ДополнительныйВыбор = Новый Структура;
	ДополнительныйВыбор.Вставить("Представление");
	ДополнительныйВыбор.Вставить("ВидКонтрагента");
	СвязанныеКонтрагенты = Справочники.КонтактныеЛица.СвязанныеКонтрагенты(Ссылка, ДополнительныйВыбор);
	
	Результат = Новый Массив;
	
	Для Каждого СвязанныйКонтрагент Из СвязанныеКонтрагенты Цикл
		
		ДанныеКонтрагента = Новый Структура;
		ДанныеКонтрагента.Вставить("Ссылка", СвязанныйКонтрагент.Ссылка);
		ДанныеКонтрагента.Вставить("Представление", СвязанныйКонтрагент.Представление);
		
		Если СвязанныйКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель
			Или СвязанныйКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо Тогда
			
			ДанныеКонтрагента.Вставить("Картинка", БиблиотекаКартинок.КоллекцияКонтрагентыФизическоеЛицо);
			
		Иначе
			ДанныеКонтрагента.Вставить("Картинка", БиблиотекаКартинок.КоллекцияКонтрагентыКомпания);
		КонецЕсли;
		
		Результат.Добавить(ДанныеКонтрагента);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ВывестиДанныеПоКонтакту(ДанныеСтроки)
	
	КоличествоДокументов = КоличествоДокументовКлиента(ДанныеСтроки.Ссылка);
	
	ДополнительныйВыбор = Новый Структура("Представление");
	Контрагенты = Справочники.КонтактныеЛица.СвязанныеКонтрагенты(ДанныеСтроки.Ссылка, ДополнительныйВыбор);
	КоличествоКонтрагентов = Контрагенты.Количество();
	
	Если КоличествоКонтрагентов = 0 Тогда
		ПредставлениеСпискаКонтрагентов = НСтр("ru = 'Нет связанных контрагентов'");
	ИначеЕсли КоличествоКонтрагентов = 1 Тогда
		
		ПредставлениеСпискаКонтрагентов = СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = 'Связанные контрагенты: <a href=""%1"">%2</a>'"),
		ПолучитьНавигационнуюСсылку(Контрагенты[0].Ссылка), Контрагенты[0].Представление);
		
	ИначеЕсли КоличествоКонтрагентов >= 2 Тогда
		
		НавигационнаяСсылка1 = ПолучитьНавигационнуюСсылку(Контрагенты[0].Ссылка);
		НавигационнаяСсылка2 = ПолучитьНавигационнуюСсылку(Контрагенты[1].Ссылка);
		
		Если КоличествоКонтрагентов = 2 Тогда
			
			ПредставлениеСпискаКонтрагентов = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'Связанные контрагенты: <a href=""%1"">%2</a>, <a href=""%3"">%4</a>'"),
			НавигационнаяСсылка1, Контрагенты[0].Представление,
			НавигационнаяСсылка2, Контрагенты[1].Представление);
			
		Иначе
			
			ПредставлениеСпискаКонтрагентов = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 контрагент;;%1 контрагента;%1 контрагентов;%1 контрагента'"), КоличествоКонтрагентов);
			
			ПредставлениеСпискаКонтрагентов = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'Связанные контрагенты: <a href=""%1"">%2</a>, <a href=""%3"">%4</a> и другие (всего <a href=""https://1c.ru"">%5</a>)'"),
			НавигационнаяСсылка1, Контрагенты[0].Представление,
			НавигационнаяСсылка2, Контрагенты[1].Представление,
			ПредставлениеСпискаКонтрагентов);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.НаименованиеКлиента.Заголовок = ДанныеСтроки.Наименование;
	Элементы.ТипКлиента.Заголовок = НСтр("ru = '(Контакт)'");
	Элементы.Документы.Заголовок = СтрШаблон(НСтр("ru = 'События (%1)'"), КоличествоДокументов);
	Элементы.ПометитьКонтактаНаУдаление.Заголовок = ЗаголовокКнопкиНаПометкуНаУдаление(ДанныеСтроки.ПометкаУдаления);
	
	Элементы.ИнформацияПоКлиенту.Видимость = Истина;
	Элементы.ИнформацияПоКлиенту.Заголовок = ПредставлениеСпискаКонтрагентов;
	
	Элементы.СтраницыКоманды.ТекущаяСтраница = Элементы.СтраницаКомандыКонтактов;
	
КонецПроцедуры

#КонецОбласти

#Область Лиды

&НаСервереБезКонтекста
Функция НекачественныйЛидНаСервере(Знач Лид)
	
	Если Не ЧтениеРазрешеноНаСервере(Лид) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Лид, "ВариантЗавершения");
	
КонецФункции

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыНекачественногоЛида(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПеревестиВНекачественныйЛидСервер(Результат, Элементы.ДеревоДублей.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ПеревестиВНекачественныйЛидСервер(Знач ДанныеНекачественногоЛида, Знач НомерСтроки)
	
	Попытка
		
		ЛидОбъект = НекачественныйЛид.ПолучитьОбъект();
		ЛидОбъект.Заблокировать();
		
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("ПереводВНекачественныйЛид", Истина);
		ДанныеЗаполнения.Вставить("ПричинаНеуспешногоЗавершенияРаботы",
		ДанныеНекачественногоЛида.ПричинаНеуспешногоЗавершенияРаботы);
		ДанныеЗаполнения.Вставить("ЗаметкиЗавершенияРаботы", ДанныеНекачественногоЛида.Комментарий);
		
		ЛидОбъект.Заполнить(ДанныеЗаполнения);
		ЛидОбъект.Записать();
		
		УдалитьСтрокуДереваНаСервере(НомерСтроки, "Лид");
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке), НекачественныйЛид);
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось перевести лида %1 в некачественный
		|
		|Описание ошибки:
		|%2'"),
		НекачественныйЛид,
		ТекстОшибки);
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Данные.Изменение'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , ,
		ТекстОшибки);
		
	КонецПопытки;
	
	НекачественныйЛид = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиДанныеПоЛиду(ДанныеСтроки)
	
	КоличествоДокументов = КоличествоДокументовКлиента(ДанныеСтроки.Ссылка);
	
	ВидОбращения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСтроки.Ссылка, "Вид");
	Если ВидОбращения = Перечисления.ВидыЛидов.ПовторноеОбращение Тогда
		ТипКлиента = НСтр("ru = '(Лид: Повторное обращение)'");
	Иначе
		ТипКлиента = НСтр("ru = '(Лид: Первичное обращение)'");
	КонецЕсли;
	
	Если ВидОбращения = Перечисления.ВидыЛидов.ПервичноеОбращение Тогда
		ВидимостьИнформацииПоКлиенту = Ложь;
	Иначе
		
		Контрагент = Справочники.Лиды.СвязанныйКонтрагент(ДанныеСтроки.Ссылка);
		Если Не ЗначениеЗаполнено(Контрагент) Тогда
			ПредставлениеКонтрагента = НСтр("ru = 'Нет связанного контрагента'");
		Иначе
			
			ПредставлениеКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Представление");
			
			ПредставлениеКонтрагента = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'Связан с контрагентом <a href=""%1"">%2</a>'"),
			ПолучитьНавигационнуюСсылку(Контрагент), ПредставлениеКонтрагента);
			
		КонецЕсли;
		
		ВидимостьИнформацииПоКлиенту = Истина;
		
	КонецЕсли;
	
	Элементы.НаименованиеКлиента.Заголовок = ДанныеСтроки.Представление;
	Элементы.ТипКлиента.Заголовок = ТипКлиента;
	Элементы.Документы.Заголовок = СтрШаблон(НСтр("ru = 'События (%1)'"), КоличествоДокументов);
	Элементы.ПометитьЛидаНаУдаление.Заголовок = ЗаголовокКнопкиНаПометкуНаУдаление(ДанныеСтроки.ПометкаУдаления);
	
	Если ВидимостьИнформацииПоКлиенту Тогда
		Элементы.ИнформацияПоКлиенту.Видимость = Истина;
		Элементы.ИнформацияПоКлиенту.Заголовок = ПредставлениеКонтрагента;
	Иначе
		Элементы.ИнформацияПоКлиенту.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.СтраницыКоманды.ТекущаяСтраница = Элементы.СтраницаКомандыЛидов;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПерейтиКЛиду(Ссылка)
	
	ВариантЗавершения = ПерейтиКЛидуНаСервере(Ссылка);
	Если ВариантЗавершения = Неопределено Тогда
		ПредупреждениеОНевозможностиЧтенияОбъекта();
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВариантЗавершения) Тогда
		ТекстВопроса =
		НСтр("ru = 'Лид помечен как некачественный. Продолжить работу с выбранным лидом без сохранения текущего?'");
	Иначе
		ТекстВопроса = НСтр("ru = 'Продолжить работу с выбранным лидом без сохранения текущего?'");
	КонецЕсли;
	
	ОтветПользователя = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Если ОтветПользователя <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ВыбранДубльЛида", Истина);
	ПараметрыЗакрытия.Вставить("ВыбранныйЛид", Ссылка);
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПерейтиКЛидуНаСервере(Знач Лид)
	
	Если Не ЧтениеРазрешеноНаСервере(Лид) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Лид, "ВариантЗавершения");
	
КонецФункции

#КонецОбласти

#Область ОбработкаВсехТиповКлиентов

&НаКлиенте
Процедура ОбъединитьКлиентовПоТипу(Тип)
	
	ЭлементыДерева = ЭлементыДереваПоТипу(Тип);
	Если ЭлементыДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивКлиентов = Новый Массив;
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		МассивКлиентов.Добавить(ЭлементДерева.Ссылка);
	КонецЦикла;
	
	ПоискИУдалениеДублейКлиент.ОбъединитьВыделенные(МассивКлиентов);
	
КонецПроцедуры

&НаСервере
Функция ПометитьНаУдалениеНаСервере(Знач Ссылка, Знач ТекущаяПометкаУдаления)
	
	КлиентОбъект = Ссылка.ПолучитьОбъект();
	КлиентОбъект.Заблокировать();
	КлиентОбъект.УстановитьПометкуУдаления(Не ТекущаяПометкаУдаления);
	
	ТипКлиента = ТипЗнч(Ссылка);
	ЗаголовокКнопки = ЗаголовокКнопкиНаПометкуНаУдаление(Не ТекущаяПометкаУдаления);
	Если ТипКлиента = Тип("СправочникСсылка.Контрагенты") Тогда
		Элементы.ПометитьКонтрагентаНаУдаление.Заголовок = ЗаголовокКнопки;
	ИначеЕсли ТипКлиента = Тип("СправочникСсылка.КонтактныеЛица") Тогда
		Элементы.ПометитьКонтактаНаУдаление.Заголовок = ЗаголовокКнопки;
	Иначе
		Элементы.ПометитьЛидаНаУдаление.Заголовок = ЗаголовокКнопки;
	КонецЕсли;
	
	Если ТипКлиента = Тип("СправочникСсылка.Контрагенты") Тогда
		ВидКлиента = КлиентОбъект.ВидКонтрагента;
	ИначеЕсли ТипКлиента = Тип("СправочникСсылка.Лиды") Тогда
		ВидКлиента = КлиентОбъект.Вид;
	КонецЕсли;
	
	НовыйНомерИконки = ЭлектроннаяПочтаУНФ.НомерКартинкиУчастникаПоТипуКонтакта(
	Ссылка, ВидКлиента, Не ТекущаяПометкаУдаления);
	
	Возврат Новый Структура("НомерИконки", НовыйНомерИконки);
	
КонецФункции

&НаСервере
Функция КоличествоДокументовКлиента(Клиент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокументыПоКритериюОтбора.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ втДокументы
		|ИЗ
		|	КритерийОтбора.ДокументыПоКонтрагенту(&Клиент) КАК ДокументыПоКритериюОтбора
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СобытиеУчастники.Ссылка
		|ИЗ
		|	РегистрСведений.СвязиАдресатКонтактCRM КАК СвязиАдресатКонтактCRM
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Событие.Участники КАК СобытиеУчастники
		|		ПО СвязиАдресатКонтактCRM.Адресат = СобытиеУчастники.Контакт
		|ГДЕ
		|	СвязиАдресатКонтактCRM.КонтактCRM = &Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(втДокументы.Ссылка) КАК КоличествоДокументов
		|ИЗ
		|	втДокументы КАК втДокументы";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.КоличествоДокументов;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область РаботаСДеревом

&НаКлиенте
Функция ЭлементыДереваПоТипу(Тип)
	
	СтрокиГруппировки = ДеревоДублей.ПолучитьЭлементы();
	Для Каждого СтрокаГруппировки Из СтрокиГруппировки Цикл
		Если СтрокаГруппировки.Тип = Тип Тогда
			Возврат СтрокаГруппировки.ПолучитьЭлементы();
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ЭлементыДереваПоТипуНаСервере(Тип)
	
	СтрокиГруппировки = ДеревоДублей.ПолучитьЭлементы();
	Для Каждого СтрокаГруппировки Из СтрокиГруппировки Цикл
		Если СтрокаГруппировки.Тип = Тип Тогда
			Возврат СтрокаГруппировки.ПолучитьЭлементы();
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ВыбранаСтрокаСКлиентом()
	
	Возврат Элементы.ДеревоДублей.ТекущиеДанные <> Неопределено
	И ЗначениеЗаполнено(Элементы.ДеревоДублей.ТекущиеДанные.Ссылка);
	
КонецФункции

&НаСервере
Процедура УдалитьСтрокуДереваНаСервере(НомерСтроки, ТипСтроки)
	
	ЭлементыДерева = ЭлементыДереваПоТипуНаСервере(ТипСтроки);
	ЭлементДерева = ДеревоДублей.НайтиПоИдентификатору(НомерСтроки);
	ГруппаЛидов = ЭлементДерева.ПолучитьРодителя();
	ЭлементыДерева.Удалить(ЭлементДерева);
	
	Если Не ЭлементыДерева.Количество() Тогда
		ДеревоДублей.ПолучитьЭлементы().Удалить(ГруппаЛидов);
	КонецЕсли;
	
	УстановитьВидимостьКомандыОбъединения(ТипСтроки);
	
КонецПроцедуры

&НаСервере
Функция ИдентификаторыСтрокГруппировок()
	
	Результат = Новый Массив;
	
	ЭлементыДерева = ДеревоДублей.ПолучитьЭлементы();
	Для Каждого Строка Из ЭлементыДерева Цикл
		Результат.Добавить(Строка.ПолучитьИдентификатор());
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПроверкаПравПользователя

&НаКлиенте
Функция ЧтениеРазрешено(Ссылка)
	
	ЧтениеРазрешено = ЧтениеРазрешеноНаСервере(Ссылка);
	Если Не ЧтениеРазрешено Тогда
		ПредупреждениеОНевозможностиЧтенияОбъекта();
	КонецЕсли;
	
	Возврат ЧтениеРазрешено;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЧтениеРазрешеноНаСервере(Знач Ссылка)
	
	Возврат УправлениеДоступом.ЧтениеРазрешено(Ссылка);
	
КонецФункции

&НаКлиенте
Процедура ПредупреждениеОНевозможностиЧтенияОбъекта()
	
	ПредупреждениеАсинх(НСтр("ru = 'Нет прав на чтение объекта'"));
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ОбработкаОповещенияНаСервере(Знач ИмяСобытия)
	
	Результат = Новый Структура;
	
	Если ИмяСобытия = "ПроизведенаЗаменаСсылок"
		Или ИмяСобытия = "Запись_Контрагент"
		Или ИмяСобытия = "Запись_КонтактноеЛицо"
		Или ИмяСобытия = "Запись_Лид" Тогда
		
		ОбновитьДубли();
		УправлениеФормой();
		Результат.Вставить("ИдентификаторыСтрокГруппировок", ИдентификаторыСтрокГруппировок());
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИмяФормыПоТипуСсылки(Ссылка)
	
	ТипСсылки = ТипЗнч(Ссылка);
	
	Если ТипСсылки = Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат "Справочник.Контрагенты.ФормаОбъекта";
	КонецЕсли;
	
	Если ТипСсылки = Тип("СправочникСсылка.КонтактныеЛица") Тогда
		Возврат "Справочник.КонтактныеЛица.ФормаОбъекта";
	КонецЕсли;
	
	Если ТипСсылки = Тип("СправочникСсылка.Лиды") Тогда
		Возврат "Справочник.Лиды.ФормаОбъекта";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ДеревоДублейПриАктивизацииСтрокиОбработчик()
	
	Если Не ВыбранаСтрокаСКлиентом() Тогда
		Возврат;
	КонецЕсли;
	
	ДеревоДублейПриАктивизацииСтрокиНаСервере(Элементы.ДеревоДублей.ТекущаяСтрока);
	
	ТекущийКлиент = Элементы.ДеревоДублей.ТекущиеДанные.Ссылка;
	
КонецПроцедуры

&НаСервере
Процедура ДеревоДублейПриАктивизацииСтрокиНаСервере(Знач НомерСтроки)
	
	ИзменитьДанныеКлиента(НомерСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьДанныеКлиента(НомерСтроки)
	
	ДанныеСтроки = ДеревоДублей.НайтиПоИдентификатору(НомерСтроки);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ДанныеСтроки.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		ВывестиДанныеПоКонтрагенту(ДанныеСтроки);
	ИначеЕсли ТипЗнч(ДанныеСтроки.Ссылка) = Тип("СправочникСсылка.КонтактныеЛица") Тогда
		ВывестиДанныеПоКонтакту(ДанныеСтроки);
	ИначеЕсли ТипЗнч(ДанныеСтроки.Ссылка) = Тип("СправочникСсылка.Лиды") Тогда
		ВывестиДанныеПоЛиду(ДанныеСтроки);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаголовокКнопкиНаПометкуНаУдаление(ЗначениеПометки)
	
	Если ЗначениеПометки Тогда
		Возврат НСтр("ru = 'Снять пометку на удаление'");
	Иначе
		Возврат НСтр("ru = 'Пометить на удаление'");
	КонецЕсли;
	
КонецФункции

#КонецОбласти
